tutorials/multiphase/waves/porousWaveSolver/porousDamBreak/constant/postProcessingProperties
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      postProcessingProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

deleteParentOutputDirectory false;

data
{
    callName surfaceElevation;

    removeDuplicate true;
    inputDir surfaceElevation;

    deltaT 0.2;

    // action list is a set of processes on the data
    actionList (interpolateSurfaceElevation write2Ascii removeData);
}

// ************************************************************************* //
